#+OPTIONS: \n:t
#+TITLE: Battery Design
#+LANGUAGE: en
#+AUTHOR: Ivan Nikolic
#+DATE: [2024-12-02 Mon]
#+LAST_MODIFIED: [2024-12-21 Sat]


* Full battery performance/price calculation
#+BEGIN_SRC python :var tab=cells :colnames yes :hlines yes :results table :exports both

import math

cell_voltage = 4.2
cell_series = 20
target_kwh = 3

def process(row):
    [name, price, capacity, weight, maxA, batt_type, height, diam] = row

    # full battery voltage (aiming for 72/84v)
    total_voltage = (cell_voltage * cell_series)
    
    # required capacity (Ah) of a single series stage to achieve target kWh
    single_series_ah = (target_kwh * 1000) / total_voltage
    
    # number of cells required in each stage
    P = math.ceil(single_series_ah / capacity)
    
    # total battery kWh
    kWh = (P *  capacity * total_voltage) / 1000

    # total cells in the battery
    cell_n = P * 20

    # full price, weight
    total_price = round(cell_n * price)
    total_weight = round(cell_n * weight) / 1000

    # max safe discharge
    total_maxA = P * maxA

    return [name, P, kWh, total_price, total_weight, total_maxA, cell_n]

return([['Name', '20SxP', 'kWh', 'Price (EUR)', 'Weight (Kg)', 'Max (A)', 'Cell Count']] + 
       [process(row) for row in tab])

#+END_SRC

#+RESULTS:
| Name                 | 20SxP |    kWh | Price (EUR) | Weight (Kg) | Max (A) | Cell Count |
|----------------------+-------+--------+-------------+-------------+---------+------------|
| LG INR18650MH1       |    12 | 3.1248 |         660 |       11.28 |      72 |        240 |
| Sanyo NCR18650GA     |    11 | 3.1878 |         858 |       10.34 |     110 |        220 |
| Keeppower IMR26650   |     7 | 3.0576 |        1253 |      13.146 |     105 |        140 |
| Keeppower 26650      |     7 | 3.0576 |        1323 |       13.58 |      70 |        140 |
| Lishen LR2170SD      |     8 | 3.2256 |         608 |       11.68 |    76.8 |        160 |
| Samsung INR21700     |     7 | 3.0576 |         791 |        9.38 |     105 |        140 |
| Samsung INR21700-50S |     8 |   3.36 |         506 |       11.52 |     280 |        160 |
| Headway LifePO4      |     4 |   3.36 |        1200 |       27.68 |      80 |         80 |

Samsung INR21700 seems most promising

